<a href="https://colab.research.google.com/github/irfanizzath/Dubai-Real-Estate/blob/main/Data_Preprocessing.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

#**Dubai Real Estate Data**


**Data Preprocessing**

> Dataset Source: **Dubai Pulse**

In [1]:
import pandas as pd
import matplotlib.pyplot as pl
from matplotlib import RcParams
import numpy as np
import seaborn as sns
import warnings
warnings.filterwarnings('ignore')

In [ ]:
df = pd.read_csv('/content/Transactions.csv', engine='python', encoding='utf-8', on_bad_lines='skip')
pd.set_option('display.max_colwidth', None)

In [ ]:
n = []
for i in df.columns:
  if '_ar' not in i[-3:]:
    n.append(i)
df = df[n]

In [ ]:
df.shape

(1557420, 32)

In [ ]:
df.isnull().sum()

transaction_id                0
procedure_id                  0
trans_group_id                0
trans_group_en                0
procedure_name_en             0
instance_date                 0
property_type_id              0
property_type_en              0
property_sub_type_id     322611
property_sub_type_en     322611
property_usage_en             0
reg_type_id                   0
reg_type_en                   0
area_id                       0
area_name_en                  0
building_name_en         457726
project_number           443551
project_name_en          443551
master_project_en        230719
nearest_landmark_en      286039
nearest_metro_en         453688
nearest_mall_en          462043
rooms_en                 343142
has_parking                   0
procedure_area                0
actual_worth                  0
meter_sale_price              0
rent_value              1521263
meter_rent_price        1521263
no_of_parties_role_1        968
no_of_parties_role_2        968
no_of_parties_role_3        968
dtype: int64

In [ ]:
developer_map = {
    # ---------------- EMAAR ----------------
    'Emaar': [
        'Downtown Dubai', 'Emirates Hills', 'Dubai Hills', 'Dubai Hills Estate',
        'Arabian Ranches', 'Arabian Ranches II', 'Arabian Ranches III',
        'The Springs', 'The Meadows', 'The Lakes', 'The Greens', 'The Views',
        'Dubai Marina', 'The Residences', 'Burj Khalifa', 'Boulevard',
        'Creek Harbour', 'Dubai Creek Harbour', 'Dubai Hills -',
        'Emaar South', "Emaar's Street Of Dreams"
    ],

    # ---------------- DAMAC ----------------
    'Damac': [
        'DAMAC Hills', 'DAMAC Hills 2', 'DAMAC Lagoons', 'Akoya', 'Akoya Oxygen'
    ],

    # ---------------- NAKHEEL ----------------
    'Nakheel': [
        'Palm Jumeirah', 'Palm Jabal Ali', 'Jumeirah Islands', 'Jumeirah Park',
        'Jumeirah Heights', 'Jumeirah Village Circle', 'Jumeirah Village Triangle',
        'Discovery Gardens', 'The Gardens', 'Al Furjan', 'International City',
        'Deira Islands', 'Veneto', 'The World', 'Palm Deira'
    ],

    # ---------------- SOBHA ----------------
    'Sobha': ['Sobha Hartland', 'Sobha Reserve', 'Sobha One'],

    # ---------------- MERAAS ----------------
    'Meraas': [
        'City Walk', 'Bluewaters Island', 'La Mer', 'Jumeira Bay', 'Pearl Jumeira',
        'Boxpark', 'Nikki Beach', 'Al Wasl District', 'Jumeirah Garden City'
    ],

    # ---------------- DUBAI PROPERTIES (DP) ----------------
    'Dubai Properties': [
        'Mudon', 'Remraam', 'The Villa', 'Business Bay', 'Jaddaf Waterfront',
        'Culture Village', 'Marasi Business Bay', 'Dubai Wharf', 'Manazel Al Khor',
        'Dubai Land Residence Complex', 'Madinat Badr', 'Al Waha Villas'
    ],

    # ---------------- NSHAMA ----------------
    'Nshama': ['Town Square'],

    # ---------------- MAJID AL FUTTAIM ----------------
    'Majid Al Futtaim': ['Tilal Al Ghaf'],

    # ---------------- WASL ----------------
    'Wasl': ['Wasl 1', 'Wasl Gate', 'Wasl District', 'Al Wasl District'],

    # ---------------- MEYDAN ----------------
    'Meydan': [
        'Meydan One Community', 'Meydan Racecourse Community', 'Mohammed Bin Rashid AL Maktoum City',
        'Mohammed Bin Rashid AL Maktoum District 11', 'Mohammed Bin Rashid AL Maktoum District -1',
        'Hadaeq Sheikh Mohammed Bin Rashid', 'Nad Al Sheba Gardens'
    ],

    # ---------------- FALCON CITY ----------------
    'Falcon City': ['Falcon City'],

    # ---------------- DUBAI SOUTH ----------------
    'Dubai South': [
        'Dubai South', 'Dubai World Central', 'Dubai South Residential District'
    ],

    # ---------------- DUBAI SILICON OASIS ----------------
    'Dubai Silicon Oasis Authority': [
        'Silicon Oasis', 'Dubai Digital Park'
    ],

    # ---------------- TECOM GROUP ----------------
    'TECOM Group': [
        'Barsha Heights', 'Dubai Internet City', 'Dubai Media City', 'Dubiotech',
        'Dubai Science Park', 'International Media Production Zone',
        'Dubai Outsource City', 'Knowledge Village', 'Dubai Studio City', 'TECOM Site A',
        'TECOM Site B', 'TECOM Site C', 'TECOM Site D'
    ],

    # ---------------- DUBAI INDUSTRIAL CITY ----------------
    'Dubai Industrial City': [
        'Dubai Industrial City', 'Jabal Ali Industrial', 'Jabal Ali Industrial Development'
    ],

    # ---------------- DUBAI INVESTMENTS ----------------
    'Dubai Investments': ['Dubai Investments Park', 'Dubai Investment Park First', 'Dubai Investment Park Second'],

    # ---------------- DUBAI HOLDING ----------------
    'Dubai Holding': [
        'Dubai Design District', 'Dubai Health Care City Phase 1', 'Dubai Health Care City Phase 2',
        'Dubai Science Park', 'Dubai Studio City', 'Global Village', 'Business Park',
        'Dubai Industrial City'
    ],

    # ---------------- DUBAI PROPERTIES (PART OF DH) ----------------
    'Dubai Properties (DH)': [
        'Dubai Wharf', 'Manazel Al Khor', 'Mudon', 'The Villa', 'Remraam', 'Business Bay'
    ],

    # ---------------- UNION PROPERTIES ----------------
    'Union Properties': ['Motor City', 'Green Community'],

    # ---------------- DANUBE ----------------
    'Danube': [
        'WARSAN FIRST DEVELOPMENT', 'Olivz', 'Skyz', 'Petalz', 'Glamz', 'Resortz', 'Lawnz'
    ],

    # ---------------- AZIZI ----------------
    'Azizi Developments': [
        'Al Furjan', 'Meydan', 'Dubai Healthcare City', 'Palm Jumeirah', 'Jebel Ali Village'
    ],

    # ---------------- DEYAAR ----------------
    'Deyaar': [
        'Al Barsha South', 'Al Barsha Heights', 'Dubai Silicon Oasis'
    ],

    # ---------------- TILAL AL GHAF (MAF) ----------------
    'Majid Al Futtaim': ['Tilal Al Ghaf'],

    # ---------------- OTHER DEVELOPERS ----------------
    'Dubai Maritime City Authority': ['Dubai Maritime City'],
    'Limitless': ['Downtown Jebel Ali', 'Tijara Town'],
    'Mizin': ['Liwan', 'Arjan'],
    'Tameer': ['Dubailand'],
    'MAG': ['MAG City', 'Meydan District 7'],
    'Omniyat': ['Business Bay', 'Marasi Bay'],
    'Select Group': ['Dubai Marina', 'Business Bay'],
    'Ellington': ['Meydan', 'JVC'],
    'Danube': ['Olivz', 'Skyz', 'Glamz', 'WARSAN FIRST DEVELOPMENT'],
    'Triplanet': ['Elite Residences', 'Elite Sports City'],
    'Tiger': ['Al Furjan', 'JVC', 'Business Bay'],
    'Binghatti': ['JVC', 'Business Bay'],
    'Diyar': ['Dubai Silicon Oasis'],
    'Zarooni': ['Jumeirah Village Circle']
}


import numpy as np
import pandas as pd

def get_developer(project):
    if pd.isna(project):
        return np.nan
    for dev, keywords in developer_map.items():
        for word in keywords:
            if word.lower() in project.lower():
                return dev
    return 'Other'

df['developer_name'] = df['master_project_en'].apply(get_developer)

In [ ]:
df.columns

Index(['transaction_id', 'procedure_id', 'trans_group_id', 'trans_group_en',
       'procedure_name_en', 'instance_date', 'property_type_id',
       'property_type_en', 'property_sub_type_id', 'property_sub_type_en',
       'property_usage_en', 'reg_type_id', 'reg_type_en', 'area_id',
       'area_name_en', 'building_name_en', 'project_number', 'project_name_en',
       'master_project_en', 'nearest_landmark_en', 'nearest_metro_en',
       'nearest_mall_en', 'rooms_en', 'has_parking', 'procedure_area',
       'actual_worth', 'meter_sale_price', 'rent_value', 'meter_rent_price',
       'no_of_parties_role_1', 'no_of_parties_role_2', 'no_of_parties_role_3',
       'developer_name'],
      dtype='object')

In [ ]:
# --- Binary flags ---
df['is_near_metro'] = np.where(df['nearest_metro_en'].notna(), 1, 0)
df['is_near_mall'] = np.where(df['nearest_mall_en'].notna(), 1, 0)

# --- Dropping unnecessary columns ---
cols_to_drop = [
    'transaction_id', 'property_type_id', 'property_sub_type_id', 'reg_type_id', 'area_id', 'procedure_name_en', 'project_name_en', 'master_project_en', 'procedure_id', 'trans_group_id',
    'project_number', 'building_name_en',
    'nearest_landmark_en',
    'rent_value', 'meter_rent_price','no_of_parties_role_1', 'no_of_parties_role_2', 'no_of_parties_role_3'
]
df = df.drop(columns=cols_to_drop)

In [ ]:
df['rooms_en'].value_counts()

rooms_en
1 B/R          416329
2 B/R          294782
Studio         211836
3 B/R          166514
Office          58088
4 B/R           51690
Shop             6541
5 B/R            5359
PENTHOUSE        1620
Single Room       788
6 B/R             332
Store             319
7 B/R              50
GYM                21
8 B/R               4
9 B/R               4
10 B/R              1
Name: count, dtype: int64

In [ ]:

# --- 2. Handle missing values ---
# filling with median per area or global median
df['instance_date'] = pd.to_datetime(df['instance_date'], errors='coerce')
df['instance_date'].fillna(df['instance_date'].median(), inplace=True)

# year and month
df['year'] = df['instance_date'].dt.year
df['month'] = df['instance_date'].dt.month

df['rooms_en'] = df['rooms_en'].fillna('Unknown')

# Property sub type NaNs
df['property_sub_type_en'] = df['property_sub_type_en'].fillna('Unknown')

def clean_room_category(x):

    x = x.strip().lower()

    # Commercial categories
    commercial_terms = ['office', 'shop', 'store', 'gym']
    if any(term in x for term in commercial_terms):
        return 'Commercial'

    # Merge similar categories
    if 'single' in x:
        return 'Studio'
    if 'studio' in x:
        return 'Studio'
    if 'penthouse' in x:
        return 'Penthouse'

    # Bedroom numbers
    for i in range(1, 11):
        if f'{i}' in x:
            return f'{i} Bedroom'

    return 'Other'


def rooms_to_numeric(x):
    mapping = {
        'Studio': 0.5,
        '1 Bedroom': 1,
        '2 Bedroom': 2,
        '3 Bedroom': 3,
        '4 Bedroom': 4,
        'Penthouse': 4,
        '5 Bedroom': 5,
        '6 Bedroom': 6,
        '7 Bedroom': 7,
        '8 Bedroom': 8,
        '9 Bedroom': 9,
        '10 Bedroom': 10,
        'Commercial': 0,
        'Other': 0, # Map 'Other' category to 0
    }
    return mapping.get(x, 0)

df['rooms_en'] = df['rooms_en'].apply(clean_room_category)
df['rooms_numeric'] = df['rooms_en'].apply(rooms_to_numeric)

In [ ]:
df['rooms_en'].value_counts()

rooms_en
1 Bedroom     416330
Other         343142
2 Bedroom     294782
Studio        212624
3 Bedroom     166514
Commercial     64969
4 Bedroom      51690
5 Bedroom       5359
Penthouse       1620
6 Bedroom        332
7 Bedroom         50
8 Bedroom          4
9 Bedroom          4
Name: count, dtype: int64

In [ ]:
df['property_sub_type_en'].value_counts()

property_sub_type_en
Flat                  973358
Unknown               322611
Villa                 134858
Office                 67082
Hotel Apartment        27173
Shop                   16196
Hotel Rooms            14126
Workshop                 538
Stacked Townhouses       506
Store                    319
Building                 261
Warehouse                158
Clinic                    68
Show Rooms                52
Hotel                     42
Sized Partition           38
Gymnasium                 29
Parking                    4
Unit                       1
Name: count, dtype: int64

In [ ]:
df['property_usage_en'].value_counts()

property_usage_en
Residential                              1313369
Commercial                                156070
Hospitality                                41719
Other                                      18408
Residential / Commercial                   14607
Multi-Use                                   5949
Industrial                                  4940
Agricultural                                1123
Industrial / Commercial                      684
Storage                                      485
Industrial / Commercial / Residential         66
Name: count, dtype: int64

In [ ]:
df = df.apply(lambda x: x.str.strip() if x.dtype == "object" else x)

In [ ]:
# ---  Merging low-count categories into 'Mixed-Use' ---
df['property_usage_en'] = df['property_usage_en'].replace({
    'Other': 'Mixed-Use',
    'Residential / Commercial': 'Mixed-Use',
    'Multi-Use': 'Mixed-Use'
})

# --- Dropping irrelevant categories ---
drop_categories = [
    'Industrial',
    'Agricultural',
    'Industrial / Commercial',
    'Storage',
    'Industrial / Commercial / Residential'
]

df = df[~df['property_usage_en'].isin(drop_categories)]

print(df['property_usage_en'].value_counts())

property_usage_en
Residential    1313369
Commercial      156070
Hospitality      41719
Mixed-Use        38964
Name: count, dtype: int64

In [ ]:
df.shape

(1550122, 20)

In [ ]:
df['property_sub_type_en'] = df.apply(
    lambda row: row['property_type_en'] if row['property_sub_type_en'] == 'Unknown' else row['property_sub_type_en'],
    axis=1)

subtype_mapping = {
    'Hotel Rooms': 'Hotel Apartment',
    'Stacked Townhouses': 'Villa',
    'Clinic': 'Commercial',
    'Show Rooms': 'Commercial',
    'Hotel': 'Hotel Apartment',
    'Sized Partition': 'Other',
    'Gymnasium': 'Commercial',
    'Parking': 'Commercial',
    'Unit': 'Commercial',
    'Office': 'Commercial',
    'Shop': 'Commercial'
}

# Mapping
df['property_sub_type_en'] = df['property_sub_type_en'].replace(subtype_mapping)

# Replacing Unknown with property_type_en
df['property_sub_type_en'] = df.apply(
    lambda row: row['property_type_en'] if row['property_sub_type_en'] == 'Unknown' else row['property_sub_type_en'],
    axis=1
)

print(df['property_sub_type_en'].value_counts())

property_sub_type_en
Flat               973358
Villa              283425
Land               135364
Commercial          83432
Hotel Apartment     41341
Building            33164
Other                  38
Name: count, dtype: int64

In [ ]:
df.columns

Index(['trans_group_en', 'instance_date', 'property_type_en',
       'property_sub_type_en', 'property_usage_en', 'reg_type_en',
       'area_name_en', 'nearest_metro_en', 'nearest_mall_en', 'rooms_en',
       'has_parking', 'procedure_area', 'actual_worth', 'meter_sale_price',
       'developer_name', 'is_near_metro', 'is_near_mall', 'year', 'month',
       'rooms_numeric'],
      dtype='object')

In [ ]:
df['full_location'] = df['area_name_en'] + ", Dubai, United Arab Emirates"

In [ ]:
df.to_csv('dubai_real_estate_data .csv', index=False)